app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Alex"], ["password_digest", "$2a$10$Ns8bQkdow3CL98kM92p1geG.t9RLfcUnvLiBbL/kmksWMQ5Pt8o0i"], ["created_at", "2017-11-11 21:02:57.842348"], ["updated_at", "2017-11-11 21:02:57.842348"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save